<?php

return array(
    'flag_type' => array(
        0 => '未激活',
        1 => '正常',
        2 => '退卡',
        3 => '删除'
    ),
    'cost_type' => array(
        1 => '余额消费',
        2 => '次数抵扣',
        //3 => '折扣优惠', /*统计过近2周数据，记录暂未做处理*/
    ),
    'card_type' => array(
        1 => '储值卡',
        2 => '服务卡',
        3 => '综合卡',
        4 => '优惠项目清单',
    ),
    'mcard_order_osource' => array(//会员卡订单类型  及 财务表中的订单类型
        1 => '开卡',
        2 => '充值',
        3 => '升级',
        4 => '退卡',
        5 => '消费',
        6 => '调整',
        8 => '退款',
    ),
    'mcard_op_type' => array(//会员卡动作单类型
        1 => '开卡',
        2 => '充值',
        3 => '升级',
        4 => '退卡',
        5 => '消费',
        6 => '调整',
        7 => '编辑',
        8 => '激活',
        9 => '删除',
    ),
);
